Emacs.org
#+TITLE: My Emacs Configuration
#+AUTHOR: Chris Liourtas
#+EMAIL: cliourtas@kracked.tech
#+OPTIONS: num:nil
#+macro: latest-export-date (eval (format-time-string "%F %T %z"))
#+macro: word-count (eval (count-words (point-min) (point-max)))

* Emacs
*Last export {{{latest-export-date}}} with {{{word-count}}} words.*
** Early initialization of Emacs (=early-init.el=)
This file follows a script like format and is just meant for
initializing important facts about the configuration.

For starters disabling the default package manager:
#+begin_src emacs-lisp :tangle "early-init.el"
  (setq package-enable-at-startup nil)
#+end_src
Then adding the need directories to =load-path=.
#+begin_src emacs-lisp :tangle "early-init.el"
  (add-to-list 'load-path
  	     (expand-file-name "core/" user-emacs-directory))
  (add-to-list 'load-path
  	     (expand-file-name "my-emacs-packages/" user-emacs-directory))
#+end_src
** The main initialization of Emacs (=init.el=)
*** User Options
All of the user options are defined under the emacs group
=my-emacs=. A group in emacs-lisp is just a way to organize metadata
for Emacs' customization system. By modifying these values via =M-x
customize= the user can easily manipulate My-Emacs' behavior. Things
that can be modified are:
    - Enabled/Disabled Features.
    - UI (User Interface).
To define the group we use the =defgroup= macro.
#+begin_src emacs-lisp :tangle "init.el"
  (defgroup my-emacs nil
   "User options for my-emacs."
    :group 'emacs
  )
#+end_src
**** Emacs Environment Options
The =my-emacs-bibliographies= defines the files
where the global bibliographies are stored.
#+begin_src emacs-lisp :tangle "init.el"
  (defcustom my-emacs-bibliography "~/Documents/Bibliography/global.bib"
    "Where org-roam notes live."
    :group 'my-emacs
    :type 'string
  )
#+end_src

#+begin_src emacs-lisp :tangle "init.el"
  (defcustom my-emacs-bibliography-search-dir "~/Documents/Bibliography/"
    "Where org-roam notes live."
    :group 'my-emacs
    :type 'directory
  )
#+end_src

#+begin_src emacs-lisp :tangle "init.el"
  (defcustom my-emacs-bibliography-dir "~/Documents/Bibliography"
    "Where org-roam notes live."
    :group 'my-emacs
    :type 'directory
  )
#+end_src

#+begin_src emacs-lisp :tangle "init.el" 
  (defcustom my-emacs-citar-bibliographies '("~/Documents/Bibliography/global.bib")
      "List of bibliography files for Citar."
      :group 'my-emacs
      :type '(repeat file)
    )
#+end_src

#+begin_src emacs-lisp :tangle "init.el" 
  (defcustom my-emacs-citar-notes-paths'("~/Documents/Notes/")
      "List of paths for Citar notes."
      :group 'my-emacs
      :type '(repeat file)
    )
#+end_src

#+begin_src emacs-lisp :tangle "init.el"
  (defcustom my-emacs-citar-library-paths '("~/Documents/Papers" "~/Documents/Books")
     "List of of library paths for Citar."
      :group 'my-emacs
      :type '(repeat file)
   )
#+end_src
The =my-emacs-notes-dir= defines the directory
where notes are going to be stored as defined in [[id:58aed539-b711-444f-aacc-7d936ec93c16][Org Roam]].
#+begin_src emacs-lisp :tangle "init.el"
  (defcustom my-emacs-notes-dir "~/Documents/Notes"
    "Where org-roam notes live."
    :group 'my-emacs
    :type 'directory
  )
#+end_src
The =my-emacs-dailies-dir= defines the directory
where dailie notes are going to be stored as defined in [[id:58aed539-b711-444f-aacc-7d936ec93c16][Org Roam]].
#+begin_src emacs-lisp :tangle "init.el"
  (defcustom my-emacs-dailies-dir "~/Documents/Dailies"
    "Where org-roam dailies live."
     :group 'my-emacs
     :type 'directory
  )
#+end_src
The =my-emacs-blog-url= defines the URL of your Wordpress blog's
=xmlrpc= file as defined in [[id:12db6dab-fef2-48dc-8d5f-bd10ee991a56][Org2Blog]].
#+begin_src emacs-lisp :tangle "init.el"
  (defcustom my-emacs-blog-url "https://kracked.tech/xmlrpc.php"
    "The url of the blog to contact wordpress as defined in org2blog."
    :type 'string
  )
#+end_src
The =my-emacs-blog-name= defines the name of your Wordpress blog.
Its just an identifier as defined in [[id:12db6dab-fef2-48dc-8d5f-bd10ee991a56][Org2Blog]].
#+begin_src emacs-lisp :tangle "init.el"
  (defcustom my-emacs-blog-name "kracked"
    "Identifier of blog."
    :type 'string
  )
#+end_src
The =my-emacs-blog-name= defines the domain of your Wordpress blog
defined in [[id:12db6dab-fef2-48dc-8d5f-bd10ee991a56][Org2Blog]].
#+begin_src emacs-lisp :tangle "init.el"
  (defcustom my-emacs-blog-domain "kracked.tech"
    "Domain of blog.."
    :type 'string
  )
#+end_src
The =my-emacs-latex-png-dir= defines where [[id:02d5c601-ba6e-409f-89e4-0e928e8fc28a][org-latex-preview]] will
store the latex preview images.
#+begin_src emacs-lisp :tangle "init.el"
  (defcustom my-emacs-latex-png-dir "~/Documents/LatexPng/"
    "Where latex preview pngs are stored."
    :type 'directory
  )
#+end_src
**** User Interface Options
The =my-emacs-tool-bar= defines whether the toolbar
should appear or not.
#+begin_src emacs-lisp :tangle "init.el"
  (defcustom my-emacs-tool-bar -1
    "If non-nil, enable `tool-bar-mode`."
    :group 'my-emacs
    :type 'boolean
  )
#+end_src
The =my-emacs-menu-bar= defines whether the menubar
should appear or not.
#+begin_src emacs-lisp :tangle "init.el"
  (defcustom my-emacs-menu-bar -1
    "If non-nil, enable `menu-bar-mode`."
    :group 'my-emacs
    :type 'boolean
  )
#+end_src
The =my-emacs-scroll-bar= defines whether the scrollbar
should appear or not.
#+begin_src emacs-lisp :tangle "init.el"
  (defcustom my-emacs-scroll-bar -1
    "If non-nil, enable `scroll-bar-mode`."
    :group 'my-emacs
    :type 'boolean
  )
#+end_src
