Emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-11-05 Wed 12:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My Emacs Configuration</title>
<meta name="author" content="Chris Liourtas" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">My Emacs Configuration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org768a568">Emacs</a>
<ul>
<li><a href="#org0014cca">Early initialization of Emacs (<code>early-init.el</code>)</a></li>
<li><a href="#orgcf8d10f">The main initialization of Emacs (<code>init.el</code>)</a>
<ul>
<li><a href="#org4c895e8">User Options</a></li>
<li><a href="#org272d7ce">Variables</a></li>
<li><a href="#orgd0b39e9">Package Manager</a></li>
</ul>
</li>
<li><a href="#org4cd70ee">Core Functions (<code>my-emacs-functions.el</code>)</a>
<ul>
<li><a href="#org5f4480a"><span class="todo TODO">TODO</span> Vim Scrolling Mode</a></li>
<li><a href="#orgd53a701"><span class="todo TODO">TODO</span> Load Package</a></li>
</ul>
</li>
<li><a href="#org1f4a9c0">Packages</a>
<ul>
<li><a href="#orgb5b942d">General</a></li>
<li><a href="#org3024c11">Exec Path From Shell</a></li>
<li><a href="#org5b86f5a">Direnv</a></li>
<li><a href="#org353e6f1">Evil Mode</a></li>
<li><a href="#org1931674"><span class="todo TODO">TODO</span> Magit</a></li>
<li><a href="#orgac109a1">Dired</a></li>
<li><a href="#org177a125">ISpell</a></li>
<li><a href="#orge62b0da">Which-key</a></li>
<li><a href="#org9ee12f8">Eglot</a></li>
<li><a href="#org4143c5e">Eldoc-Box</a></li>
<li><a href="#orgdde959f">Flymake</a></li>
<li><a href="#org188ad6b">Org</a></li>
<li><a href="#org8673198">Org Roam</a></li>
<li><a href="#org981da86">Org2Blog</a></li>
<li><a href="#org8cf6364">Org Latex Preview</a></li>
<li><a href="#org632b9d8">Embark &amp;&amp; Consult</a></li>
<li><a href="#orge26f00e">Project</a></li>
<li><a href="#org6c10842">Themes</a></li>
<li><a href="#org6f3d1e3">Autocompletion</a></li>
<li><a href="#org0339d00">Email</a></li>
<li><a href="#orga85e3da">Org-Mime</a></li>
<li><a href="#org446311c">Programming Languages</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org768a568" class="outline-2">
<h2 id="org768a568">Emacs</h2>
<div class="outline-text-2" id="text-org768a568">
<p>
<b>Last export 2025-11-05 12:14:00 +0200 with 4150 words.</b>
</p>
</div>
<div id="outline-container-org0014cca" class="outline-3">
<h3 id="org0014cca">Early initialization of Emacs (<code>early-init.el</code>)</h3>
<div class="outline-text-3" id="text-org0014cca">
<p>
This file follows a script like format and is just meant for
initializing important facts about the configuration.
</p>

<p>
For starters disabling the default package manager:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq package-enable-at-startup nil)
</pre>
</div>
<p>
Then adding the need directories to <code>load-path</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'load-path
             (expand-file-name "core/" user-emacs-directory))
(add-to-list 'load-path
             (expand-file-name "my-emacs-packages/" user-emacs-directory))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcf8d10f" class="outline-3">
<h3 id="orgcf8d10f">The main initialization of Emacs (<code>init.el</code>)</h3>
<div class="outline-text-3" id="text-orgcf8d10f">
</div>
<div id="outline-container-org4c895e8" class="outline-4">
<h4 id="org4c895e8">User Options</h4>
<div class="outline-text-4" id="text-org4c895e8">
<p>
All of the user options are defined under the emacs group
<code>my-emacs</code>. A group in emacs-lisp is just a way to organize metadata
for Emacs' customization system. By modifying these values via <code>M-x
customize</code> the user can easily manipulate My-Emacs' behavior. Things
that can be modified are:
</p>
<ul class="org-ul">
<li>Enabled/Disabled Features.</li>
<li>UI (User Interface).</li>
</ul>
<p>
To define the group we use the <code>defgroup</code> macro.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defgroup my-emacs nil
 "User options for my-emacs."
  :group 'emacs
)
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="orgc4b4681"></a>Emacs Environment Options<br />
<div class="outline-text-5" id="text-orgc4b4681">
<p>
The <code>my-emacs-notes-dir</code> defines the directory
where notes are going to be stored as defined in <a href="#org8673198">Org Roam</a>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defcustom my-emacs-notes-dir "~/Documents/Notes"
  "Where org-roam notes live."
  :group 'my-emacs
  :type 'directory
)
</pre>
</div>
<p>
The <code>my-emacs-dailies-dir</code> defines the directory
where dailie notes are going to be stored as defined in <a href="#org8673198">Org Roam</a>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defcustom my-emacs-dailies-dir "~/Documents/Dailies"
  "Where org-roam dailies live."
   :group 'my-emacs
   :type 'directory
)
</pre>
</div>
<p>
The <code>my-emacs-blog-url</code> defines the URL of your Wordpress blog's
<code>xmlrpc</code> file as defined in <a href="#org981da86">Org2Blog</a>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defcustom my-emacs-blog-url "https://kracked.tech/xmlrpc.php"
  "The url of the blog to contact wordpress as defined in org2blog."
  :type 'string
)
</pre>
</div>
<p>
The <code>my-emacs-blog-name</code> defines the name of your Wordpress blog.
Its just an identifier as defined in <a href="#org981da86">Org2Blog</a>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defcustom my-emacs-blog-name "kracked"
  "Identifier of blog."
  :type 'string
)
</pre>
</div>
<p>
The <code>my-emacs-blog-name</code> defines the domain of your Wordpress blog
defined in <a href="#org981da86">Org2Blog</a>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defcustom my-emacs-blog-domain "kracked.tech"
  "Domain of blog.."
  :type 'string
)
</pre>
</div>
<p>
The <code>my-emacs-latex-png-dir</code> defines where <a href="#org8cf6364">org-latex-preview</a> will
store the latex preview images.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defcustom my-emacs-latex-png-dir "~/Documents/LatexPng/"
  "Where latex preview pngs are stored."
  :type 'directory
)
</pre>
</div>
</div>
</li>
<li><a id="org3a9a4fc"></a>User Interface Options<br />
<div class="outline-text-5" id="text-org3a9a4fc">
<p>
The <code>my-emacs-tool-bar</code> defines whether the toolbar
should appear or not.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defcustom my-emacs-tool-bar -1
  "If non-nil, enable `tool-bar-mode`."
  :group 'my-emacs
  :type 'boolean
)
</pre>
</div>
<p>
The <code>my-emacs-menu-bar</code> defines whether the menubar
should appear or not.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defcustom my-emacs-menu-bar -1
  "If non-nil, enable `menu-bar-mode`."
  :group 'my-emacs
  :type 'boolean
)
</pre>
</div>
<p>
The <code>my-emacs-scroll-bar</code> defines whether the scrollbar
should appear or not.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defcustom my-emacs-scroll-bar -1
  "If non-nil, enable `scroll-bar-mode`."
  :group 'my-emacs
  :type 'boolean
)
</pre>
</div>
</div>
</li>
