init.el
(defgroup my-emacs nil
 "User options for my-emacs."
  :group 'emacs
)

(defcustom my-emacs-notes-dir "~/Documents/Notes"
  "Where org-roam notes live."
  :group 'my-emacs
  :type 'directory
)

(defcustom my-emacs-dailies-dir "~/Documents/Dailies"
  "Where org-roam dailies live."
   :group 'my-emacs
   :type 'directory
)

(defcustom my-emacs-blog-url "https://kracked.tech/xmlrpc.php"
  "The url of the blog to contact wordpress as defined in org2blog."
  :type 'string
)

(defcustom my-emacs-blog-name "kracked"
  "Identifier of blog."
  :type 'string
)

(defcustom my-emacs-blog-domain "kracked.tech"
  "Domain of blog.."
  :type 'string
)

(defcustom my-emacs-latex-png-dir "~/Documents/LatexPng/"
  "Where latex preview pngs are stored."
  :type 'directory
)

(defcustom my-emacs-tool-bar -1
  "If non-nil, enable `tool-bar-mode`."
  :group 'my-emacs
  :type 'boolean
)

(defcustom my-emacs-menu-bar -1
  "If non-nil, enable `menu-bar-mode`."
  :group 'my-emacs
  :type 'boolean
)

(defcustom my-emacs-scroll-bar -1
  "If non-nil, enable `scroll-bar-mode`."
  :group 'my-emacs
  :type 'boolean
)
