Emacs.org
**** Feature Options
The =my-emacs-vim-scrolling= defines whether vim-like scrolling
should be enabled or not.
#+begin_src emacs-lisp :tangle "init.el"
  (defcustom my-emacs-vim-scrolling t
    "If non-nil, enable smooth scrolling, like vim."
     :group 'my-emacs
     :type 'boolean
  )
#+end_src
The =my-emacs-evil= defines whether [[id:1a2f1081-efdf-4a45-84c0-e0f46281a0fb][Evil Mode]] should be
enabled or not.
#+begin_src emacs-lisp :tangle "init.el"
  (defcustom my-emacs-evil t
      "If non-nil, enable evil mode for vim emulation."
       :group 'my-emacs
       :type 'boolean
  )
#+end_src
*** Variables
Directory that contains all of the =use-package= declarations.
#+begin_src emacs-lisp :tangle "init.el"
  (defvar my-emacs-packages-dir
    (concat user-emacs-directory "my-emacs-packages/")
    "Directory that contains all of the `USE-PACKAGE` declarations."
  )
#+end_src
Ordered priority of packages that must be loaded.
#+begin_src emacs-lisp :tangle "init.el"
  (defvar my-emacs-packages-priority
    '("my-emacs-general.el")
    "Basenames or regexps of packages files to load first (ordered)."
  )
#+end_src
*** Package Manager
This emacs configuration uses [[https://github.com/progfolio/elpaca][elpaca]] as its package manager (for
now). I have been thinking of switching to a manual approach but for
now this will do. This will clone elpaca into your =user-emacs-directory= under
the elpaca subdirectory, clone it and finally activate it.
#+begin_src emacs-lisp :tangle "init.el"
  (defvar elpaca-installer-version 0.11)
  (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
  (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
  (defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
  (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                                :ref nil :depth 1 :inherit ignore
                                :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                                :build (:not elpaca--activate-package)))
  (let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
         (build (expand-file-name "elpaca/" elpaca-builds-directory))
         (order (cdr elpaca-order))
         (default-directory repo))
    (add-to-list 'load-path (if (file-exists-p build) build repo))
    (unless (file-exists-p repo)
      (make-directory repo t)
      (when (<= emacs-major-version 28) (require 'subr-x))
      (condition-case-unless-debug err
          (if-let* ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                    ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                    ,@(when-let* ((depth (plist-get order :depth)))
                                                        (list (format "--depth=%d" depth) "--no-single-branch"))
                                                    ,(plist-get order :repo) ,repo))))
                    ((zerop (call-process "git" nil buffer t "checkout"
                                          (or (plist-get order :ref) "--"))))
                    (emacs (concat invocation-directory invocation-name))
                    ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                          "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                    ((require 'elpaca))
                    ((elpaca-generate-autoloads "elpaca" repo)))
              (progn (message "%s" (buffer-string)) (kill-buffer buffer))
            (error "%s" (with-current-buffer buffer (buffer-string))))
        ((error) (warn "%s" err) (delete-directory repo 'recursive))))
    (unless (require 'elpaca-autoloads nil t)
      (require 'elpaca)
      (elpaca-generate-autoloads "elpaca" repo)
      (let ((load-source-file-function nil)) (load "./elpaca-autoloads"))))
  (add-hook 'after-init-hook #'elpaca-process-queues)
  (elpaca `(,@elpaca-order))
  #+end_src
Then I enable use-package
#+begin_src emacs-lisp :tangle "init.el"
    (elpaca elpaca-use-package
      (elpaca-use-package-mode))
#+end_src
I use use-package for declaratively configuring emacs 
#+begin_src emacs-lisp :tangle "init.el"
  (use-package emacs
    :ensure nil
    :config
    (load "my-emacs-functions")
    (tool-bar-mode my-emacs-tool-bar)
    (menu-bar-mode my-emacs-menu-bar)
    (scroll-bar-mode my-emacs-scroll-bar)
    (my-emacs-vim-scrolling-mode my-emacs-vim-scrolling)
    (my-emacs-load-packages) 
    (display-line-numbers-mode nil)
    (set-face-attribute 'default nil :family "0xProtoNerdFont" :height 120)
  )
#+end_src
** Core Functions (=my-emacs-functions.el=)
This file contains functions that:
  - Have no dependencies.
  - Do not warrant a creation of a library and/or mode.
  - May or not be moved as a library and/or mode later.
*** TODO Vim Scrolling Mode
This is not a mode, its a function. It might be a good idea to make it
a minor mode later, so for now its marked as TODO.
#+begin_src emacs-lisp :tangle "core/my-emacs-functions.el" :mkdirp yes
  (defun my-emacs-vim-scrolling-mode (enable)
    "Enable or disable 'vim-like' smooth scrolling depending on ENABLE."
    (if enable (progn
  	       (setq scroll-step 1)
  	       (setq scroll-margin 1)
  	       (setq scroll-conservatively 9999)))
  )
#+end_src
