Emacs.html
<li><a id="org2832e83"></a>Feature Options<br />
<div class="outline-text-5" id="text-org2832e83">
<p>
The <code>my-emacs-vim-scrolling</code> defines whether vim-like scrolling
should be enabled or not.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defcustom my-emacs-vim-scrolling t
  "If non-nil, enable smooth scrolling, like vim."
   :group 'my-emacs
   :type 'boolean
)
</pre>
</div>
<p>
The <code>my-emacs-evil</code> defines whether <a href="#org353e6f1">Evil Mode</a> should be
enabled or not.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defcustom my-emacs-evil t
    "If non-nil, enable evil mode for vim emulation."
     :group 'my-emacs
     :type 'boolean
)
</pre>
</div>
</div>
</li>
</ul>
</div>
<div id="outline-container-org272d7ce" class="outline-4">
<h4 id="org272d7ce">Variables</h4>
<div class="outline-text-4" id="text-org272d7ce">
<p>
Directory that contains all of the <code>use-package</code> declarations.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defvar my-emacs-packages-dir
  (concat user-emacs-directory "my-emacs-packages/")
  "Directory that contains all of the `USE-PACKAGE` declarations."
)
</pre>
</div>
<p>
Ordered priority of packages that must be loaded.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defvar my-emacs-packages-priority
  '("my-emacs-general.el")
  "Basenames or regexps of packages files to load first (ordered)."
)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd0b39e9" class="outline-4">
<h4 id="orgd0b39e9">Package Manager</h4>
<div class="outline-text-4" id="text-orgd0b39e9">
<p>
This emacs configuration uses <a href="https://github.com/progfolio/elpaca">elpaca</a> as its package manager (for
now). I have been thinking of switching to a manual approach but for
now this will do. This will clone elpaca into your <code>user-emacs-directory</code> under
the elpaca subdirectory, clone it and finally activate it.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defvar elpaca-installer-version 0.11)
(defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
(defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
(defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
(defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                              :ref nil :depth 1 :inherit ignore
                              :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                              :build (:not elpaca--activate-package)))
(let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
       (build (expand-file-name "elpaca/" elpaca-builds-directory))
       (order (cdr elpaca-order))
       (default-directory repo))
  (add-to-list 'load-path (if (file-exists-p build) build repo))
  (unless (file-exists-p repo)
    (make-directory repo t)
    (when (&lt;= emacs-major-version 28) (require 'subr-x))
    (condition-case-unless-debug err
        (if-let* ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                  ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                  ,@(when-let* ((depth (plist-get order :depth)))
                                                      (list (format "--depth=%d" depth) "--no-single-branch"))
                                                  ,(plist-get order :repo) ,repo))))
                  ((zerop (call-process "git" nil buffer t "checkout"
                                        (or (plist-get order :ref) "--"))))
                  (emacs (concat invocation-directory invocation-name))
                  ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                        "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                  ((require 'elpaca))
                  ((elpaca-generate-autoloads "elpaca" repo)))
            (progn (message "%s" (buffer-string)) (kill-buffer buffer))
          (error "%s" (with-current-buffer buffer (buffer-string))))
      ((error) (warn "%s" err) (delete-directory repo 'recursive))))
  (unless (require 'elpaca-autoloads nil t)
    (require 'elpaca)
    (elpaca-generate-autoloads "elpaca" repo)
    (let ((load-source-file-function nil)) (load "./elpaca-autoloads"))))
(add-hook 'after-init-hook #'elpaca-process-queues)
(elpaca `(,@elpaca-order))
</pre>
</div>
<p>
Then I enable use-package
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(elpaca elpaca-use-package
  (elpaca-use-package-mode))
</pre>
</div>
<p>
I use use-package for declaratively configuring emacs 
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package emacs
  :ensure nil
  :config
  (load "my-emacs-functions")
  (tool-bar-mode my-emacs-tool-bar)
  (menu-bar-mode my-emacs-menu-bar)
  (scroll-bar-mode my-emacs-scroll-bar)
  (my-emacs-vim-scrolling-mode my-emacs-vim-scrolling)
  (my-emacs-load-packages) 
  (display-line-numbers-mode nil)
  (set-face-attribute 'default nil :family "0xProtoNerdFont" :height 120)
)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org4cd70ee" class="outline-3">
<h3 id="org4cd70ee">Core Functions (<code>my-emacs-functions.el</code>)</h3>
<div class="outline-text-3" id="text-org4cd70ee">
<p>
This file contains functions that:
</p>
<ul class="org-ul">
<li>Have no dependencies.</li>
<li>Do not warrant a creation of a library and/or mode.</li>
<li>May or not be moved as a library and/or mode later.</li>
</ul>
</div>
<div id="outline-container-org5f4480a" class="outline-4">
<h4 id="org5f4480a"><span class="todo TODO">TODO</span> Vim Scrolling Mode</h4>
<div class="outline-text-4" id="text-org5f4480a">
<p>
This is not a mode, its a function. It might be a good idea to make it
a minor mode later, so for now its marked as TODO.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun my-emacs-vim-scrolling-mode (enable)
  "Enable or disable 'vim-like' smooth scrolling depending on ENABLE."
  (if enable (progn
               (setq scroll-step 1)
               (setq scroll-margin 1)
               (setq scroll-conservatively 9999)))
)
</pre>
</div>
</div>
</div>
