core/my-emacs-functions.el
(defun my-emacs-vim-scrolling-mode (enable)
  "Enable or disable 'vim-like' smooth scrolling depending on ENABLE."
  (if enable (progn
	       (setq scroll-step 1)
	       (setq scroll-margin 1)
	       (setq scroll-conservatively 9999)))
)
