Emacs.org
*** TODO Load Package
Loading packages should be done in a fixed order since packages may depend on each other.
For example =general.el= should be loaded before =magit.el= since the latter depends on the former.
This code may look complicated so a description is warranted:
 1. First define a helper function =my-emacs--priority-match-p=.
   This function simply takes two strings =`FILE`= which is a
   full path to a file and =`PATTERN`= which is a regex string
   or just the file name.
    - If =`FILE`= is equal to =`PATTERN`= return =`TRUE`=
 2. Now define the loader =my-emacs-load-packages=. Declare
   variables:
    - =all= List of absolute paths to every =.el= file inside =my-emacs-packages-dir=.
    - =seen= A hash-table data structure created by =make-hash-table=.
    - =head= The *ORDERED* list of priority files. Initialized by
      looping =my-emacs-packages-priority= and =all=. If a string (file name)
      defined there is not in =seen= yet and matches a string in all its a
      package that needs priority. 
    - =tail= The possibly unordered list of non-prioritized files. Initialized
      by being the rest "seen" files.
    - =files= Concats the =head= and =tail=.
    Now everything is ordered.
 3. Loop through =files=, load everything.
#+begin_src emacs-lisp :tangle "core/my-emacs-functions.el"
  (defun my-emacs--priority-match-p (file pattern)
    (let ((name (file-name-nondirectory file)))
      (or (string= name pattern)
  	(string-match-p pattern name))))

  (defun my-emacs-load-packages (&optional nosort)
    "Load all '.el' files in `MY-EMACS-PACKAGES-DIR` honoring,
  `MY-EMACS-PACKAGES-PRIORITY`.If NOSORT is non-nil, do not sort the
  non-priority tail (raw FS order)."
    (let* ((all (directory-files my-emacs-packages-dir t "\\.el\\'" nosort))
           (seen (make-hash-table :test 'equal))
           (head (cl-loop for pat in my-emacs-packages-priority append
                          (cl-remove-if-not
                           (lambda (f)
                             (and (my-emacs--priority-match-p f pat)
                                  (not (gethash f seen))
                                  (prog1 t (puthash f t seen))))
                           all)))
           (tail (cl-remove-if (lambda (f) (gethash f seen)) all))
           (files (nconc head tail)))
      (dolist (f files)
        (condition-case err
            (load f nil 'nomessage)
          (error
           (message "[my-emacs] Failed to load %s: %s"
                    (file-name-nondirectory f) err))))))
#+end_src
** Packages
This section exports only =use-package= declarations for packages.
Everything that is not a use-package declaration should be in
=my-emacs-library=.
*** General
For key-binding management I use [[https://github.com/noctuid/general.el][general]]. It provides many
useful features for defining key-bindings. I mostly take advantage
of the =:general= keyword in use-package that comes with installing it.
Notice the =(elpaca-wait)= after the package declaration.
 - TODO I should probably find a way to use =general-create-definer= and then use it on use-package.
   perhaps create my own =use-package= keyword? This would allow for global usage of an "evil-leader"-like
   key and perhaps further customization for the user.
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-general.el" :mkdirp yes
  (use-package general
    :ensure (:wait t)
    :demand t
    :config
    (general-auto-unbind-keys)
  )
#+end_src
*** Exec Path From Shell
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-exec-path-from-shell.el" :mkdirp yes
  (use-package exec-path-from-shell
    :ensure t
    :config
    (when (memq window-system '(mac ns x))
     (exec-path-from-shell-initialize))
    :custom
    (exec-path-from-shell-variables '("PATH" "MANPATH"))
  )
#+end_src
*** Direnv
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-direnv.el" :mkdirp yes
  (use-package direnv
    :ensure t
    :config
    (direnv-mode)
  )
#+end_src
