Emacs.html
<div id="outline-container-orgd53a701" class="outline-4">
<h4 id="orgd53a701"><span class="todo TODO">TODO</span> Load Package</h4>
<div class="outline-text-4" id="text-orgd53a701">
<p>
Loading packages should be done in a fixed order since packages may depend on each other.
For example <code>general.el</code> should be loaded before <code>magit.el</code> since the latter depends on the former.
This code may look complicated so a description is warranted:
</p>
<ol class="org-ol">
<li>First define a helper function <code>my-emacs--priority-match-p</code>.
This function simply takes two strings <code>`FILE`</code> which is a
full path to a file and <code>`PATTERN`</code> which is a regex string
or just the file name.
<ul class="org-ul">
<li>If <code>`FILE`</code> is equal to <code>`PATTERN`</code> return <code>`TRUE`</code></li>
</ul></li>
<li><p>
Now define the loader <code>my-emacs-load-packages</code>. Declare
variables:
</p>
<ul class="org-ul">
<li><code>all</code> List of absolute paths to every <code>.el</code> file inside <code>my-emacs-packages-dir</code>.</li>
<li><code>seen</code> A hash-table data structure created by <code>make-hash-table</code>.</li>
<li><code>head</code> The <b>ORDERED</b> list of priority files. Initialized by
looping <code>my-emacs-packages-priority</code> and <code>all</code>. If a string (file name)
defined there is not in <code>seen</code> yet and matches a string in all its a
package that needs priority.</li>
<li><code>tail</code> The possibly unordered list of non-prioritized files. Initialized
by being the rest "seen" files.</li>
<li><code>files</code> Concats the <code>head</code> and <code>tail</code>.</li>
</ul>
<p>
Now everything is ordered.
</p></li>
<li>Loop through <code>files</code>, load everything.</li>
</ol>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun my-emacs--priority-match-p (file pattern)
  (let ((name (file-name-nondirectory file)))
    (or (string= name pattern)
        (string-match-p pattern name))))

(defun my-emacs-load-packages (&amp;optional nosort)
  "Load all '.el' files in `MY-EMACS-PACKAGES-DIR` honoring,
`MY-EMACS-PACKAGES-PRIORITY`.If NOSORT is non-nil, do not sort the
non-priority tail (raw FS order)."
  (let* ((all (directory-files my-emacs-packages-dir t "\\.el\\'" nosort))
         (seen (make-hash-table :test 'equal))
         (head (cl-loop for pat in my-emacs-packages-priority append
                        (cl-remove-if-not
                         (lambda (f)
                           (and (my-emacs--priority-match-p f pat)
                                (not (gethash f seen))
                                (prog1 t (puthash f t seen))))
                         all)))
         (tail (cl-remove-if (lambda (f) (gethash f seen)) all))
         (files (nconc head tail)))
    (dolist (f files)
      (condition-case err
          (load f nil 'nomessage)
        (error
         (message "[my-emacs] Failed to load %s: %s"
                  (file-name-nondirectory f) err))))))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org1f4a9c0" class="outline-3">
<h3 id="org1f4a9c0">Packages</h3>
<div class="outline-text-3" id="text-org1f4a9c0">
<p>
This section exports only <code>use-package</code> declarations for packages.
Everything that is not a use-package declaration should be in
<code>my-emacs-library</code>.
</p>
</div>
<div id="outline-container-orgb5b942d" class="outline-4">
<h4 id="orgb5b942d">General</h4>
<div class="outline-text-4" id="text-orgb5b942d">
<p>
For key-binding management I use <a href="https://github.com/noctuid/general.el">general</a>. It provides many
useful features for defining key-bindings. I mostly take advantage
of the <code>:general</code> keyword in use-package that comes with installing it.
Notice the <code>(elpaca-wait)</code> after the package declaration.
</p>
<ul class="org-ul">
<li>TODO I should probably find a way to use <code>general-create-definer</code> and then use it on use-package.
perhaps create my own <code>use-package</code> keyword? This would allow for global usage of an "evil-leader"-like
key and perhaps further customization for the user.</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package general
  :ensure (:wait t)
  :demand t
  :config
  (general-auto-unbind-keys)
)
</pre>
</div>
</div>
</div>
<div id="outline-container-org3024c11" class="outline-4">
<h4 id="org3024c11">Exec Path From Shell</h4>
<div class="outline-text-4" id="text-org3024c11">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package exec-path-from-shell
  :ensure t
  :config
  (when (memq window-system '(mac ns x))
   (exec-path-from-shell-initialize))
  :custom
  (exec-path-from-shell-variables '("PATH" "MANPATH"))
)
</pre>
</div>
</div>
</div>
<div id="outline-container-org5b86f5a" class="outline-4">
<h4 id="org5b86f5a">Direnv</h4>
<div class="outline-text-4" id="text-org5b86f5a">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package direnv
  :ensure t
  :config
  (direnv-mode)
)
</pre>
</div>
</div>
</div>
