Emacs.org
*** Evil Mode
:PROPERTIES:
:ID:       1a2f1081-efdf-4a45-84c0-e0f46281a0fb
:END:
[[https://github.com/emacs-evil/evil][Evil]] provides a vim-motions emulation layer on top of emacs. This package
should only be loaded if =my-emacs-evil= variable is non-nil.
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-evil.el" :mkdirp yes
  (use-package evil
    :ensure t
    :after general
    :if my-emacs-evil
    :custom (evil-want-keybinding nil)
    (evil-want-integration t)
    (evil-want-minibuffer t) 
    :config
    (evil-mode)
     :general (:keymaps 'evil-insert-state-map
  	    "C-k" nil
  	    "C-j" nil
  	    "C-h" nil
  	    "C-l" nil
  	    "C-d" nil
  	    "C-a" nil)
     (:keymaps 'evil-normal-state-map
  	     "C-." nil
  	      )
  )
#+end_src
[[https://github.com/emacs-evil/evil-collection][Evil-collection]] is a collection of evil bindings for the parts of Emacs that
evil does not cover properly by default.
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-evil.el"
  (use-package evil-collection
    :ensure t
    :after evil
    :config
    (evil-collection-init)
  )
#+end_src
[[https://github.com/redguardtoo/evil-nerd-commenter][Evil-Nerd-Commenter]] is just a quick and fancy way to comment code. It comes
with a few functions (no modes), but I just use =evilnc-comment-or-uncomment-lines=.
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-evil.el"
  (use-package evil-nerd-commenter
    :ensure t
    :after evil
    :general
    (:keymaps 'evil-visual-state-map
  	    "gcc" 'evilnc-comment-or-uncomment-lines)
    (:keymaps 'evil-normal-state-map
  	    "gcc" 'evilnc-comment-or-uncomment-lines)
  )
#+end_src
[[https://github.com/emacs-evil/evil-surround][Evil-Surround]] is the evil equivelant of [[https://github.com/tpope/vim-surround][surround.vim]].
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-evil.el"
  (use-package evil-surround
    :ensure t
    :after evil
    :hook evil-mode
  )
#+end_src
[[https://github.com/emacsmirror/undo-fu][Undo-Fu]] provides undo-redo for Emacs.
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-evil.el"
  (use-package undo-fu
    :ensure t
    :after evil
    :custom
    (evil-undo-system 'undo-fu)
  )
#+end_src
[[https://github.com/gabesoft/evil-mc][Evil-mc]] provides multi-cursor functionallity for emacs-evil.
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-evil.el"
  (use-package evil-mc
    :ensure t
    :after evil
    :hook
    evil-mode
    :general
    (:keymaps 'evil-visual-state-map
  	    ",a" 'evil-mc-make-all-cursors
  	    )
    (:keymaps 'evil-normal-state-map
  	    ",d" 'evil-mc-undo-all-cursors
  	    ",r" 'evil-mc-resume-cursors
  	    ",p" 'evil-mc-pause-cursors
  	    ",m" 'evil-mc-make-cursor-here
  	    )

    (:keymaps 'evil-insert-state-map
  	    "M-, a" 'evil-mc-make-all-cursors
  	    "M-, d" 'evil-mc-undo-all-cursors
  	    "M-, r" 'evil-mc-resume-cursors
  	    "M-, p" 'evil-mc-pause-cursors
  	    "M-, m" 'evil-mc-make-cursor-here
  	    )
  )
#+end_src
*** TODO Magit
[[https://github.com/magit/magit][Magit]] is a wrapper around git. Notice the dependency on transient,
perhaps it should be enabled globally as a library from source so its marked as TODO.
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-magit.el" :mkdirp yes
  (use-package transient
    :ensure t
    )

  (use-package magit
    :ensure t
    :general
    (:prefix "C-c m"
        "g" 'magit-status
        "i" 'magit-init
        "c" 'magit-clone)
  )
#+end_src
*** Dired
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-dired.el" :mkdirp yes
  (use-package dired
    :ensure nil
  )
#+end_src
*** ISpell
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-ispell.el" :mkdirp yes
  (use-package ispell
    :ensure nil 
    :custom
    (ispell-program-name "hunspell")
    (ispell-dictionary "en_US,el_GR") 
    :config
    (add-to-list 'ispell-hunspell-dictionary-alist
               '("en_US,el_GR"
                 "[[:alpha:]]"
                 "[^[:alpha:]]"
                 "['’]"
                 t
                 ("-d" "en_US,el_GR")
                 nil
                 utf-8)))
    :hook
    (latex-mode . flyspell-mode)
    (markdown-mode . flyspell-mode)
    (org-mode . flyspell-mode)
  )
#+end_src
*** Which-key
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-which-key.el" :mkdirp yes
  (use-package which-key
    :ensure nil
    :init
    (which-key-mode)
    :config 
    (which-key-setup-side-window-bottom)
    :custom
    (which-key-idle-delay 1)
    (which-key-idle-secondary-delay 0.05)
  )
#+end_src
*** Eglot
Eglot is the built in LSP server for Emacs.
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-eglot.el" :mkdirp yes
  (use-package eglot
    :ensure nil
    :commands (eglot eglot-ensure)
    :config
    :init
    (setq eglot-autoshutdown t
          eglot-events-buffer-config 0
          eglot-sync-connect nil
          eglot-confirm-server-edits nil)
  )
#+end_src
*** Eldoc-Box
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-eldoc-box.el" :mkdirp yes
  (use-package eldoc-box
    :ensure t
    :init
    (add-hook 'eglot-managed-mode-hook #'eldoc-box-hover-mode t)
    (add-hook 'prog-mode-hook #'eldoc-box-hover-mode t)
  )
#+end_src
*** Flymake
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-flymake.el" :mkdirp yes
  (use-package flymake
    :ensure nil
    :custom
    (flymake-show-diagnostics-at-end-of-line 'fancy)
    :hook
    (prog-mode . flymake-mode)
  )
#+end_src
*** Org
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-org.el" :mkdirp yes
  (use-package org
    :ensure `(org :repo "https://code.tecosaur.net/tec/org-mode.git/"
  		:branch "dev"
  	   )
    :config
     (set-face-attribute 'org-block-begin-line nil :height 150)
     (org-babel-do-load-languages
      'org-babel-load-languages
      '((python . t)
        (haskell . t)
        (latex . t)
        (shell . t))
      )
    :custom
     (org-pretty-entities t)
     (fill-column 70)
    :hook
     (org-mode . auto-fill-mode)
     (org-mode . (lambda ()
  		   (font-lock-add-keywords
  		    nil
  		    '(
  		      ("^#\\+begin_src\\(.*\\)$"
  		       (0 (progn
  			    (compose-region (match-beginning 0) (+ (match-beginning 0) 11) "")
  			    nil)))))
  		   ))

  )
#+end_src
