Emacs.html
<div id="outline-container-org353e6f1" class="outline-4">
<h4 id="org353e6f1">Evil Mode</h4>
<div class="outline-text-4" id="text-org353e6f1">
<p>
<a href="https://github.com/emacs-evil/evil">Evil</a> provides a vim-motions emulation layer on top of emacs. This package
should only be loaded if <code>my-emacs-evil</code> variable is non-nil.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package evil
  :ensure t
  :after general
  :if my-emacs-evil
  :custom (evil-want-keybinding nil)
  (evil-want-integration t)
  (evil-want-minibuffer t) 
  :config
  (evil-mode)
   :general (:keymaps 'evil-insert-state-map
            "C-k" nil
            "C-j" nil
            "C-h" nil
            "C-l" nil
            "C-d" nil
            "C-a" nil)
   (:keymaps 'evil-normal-state-map
             "C-." nil
              )
)
</pre>
</div>
<p>
<a href="https://github.com/emacs-evil/evil-collection">Evil-collection</a> is a collection of evil bindings for the parts of Emacs that
evil does not cover properly by default.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package evil-collection
  :ensure t
  :after evil
  :config
  (evil-collection-init)
)
</pre>
</div>
<p>
<a href="https://github.com/redguardtoo/evil-nerd-commenter">Evil-Nerd-Commenter</a> is just a quick and fancy way to comment code. It comes
with a few functions (no modes), but I just use <code>evilnc-comment-or-uncomment-lines</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package evil-nerd-commenter
  :ensure t
  :after evil
  :general
  (:keymaps 'evil-visual-state-map
            "gcc" 'evilnc-comment-or-uncomment-lines)
  (:keymaps 'evil-normal-state-map
            "gcc" 'evilnc-comment-or-uncomment-lines)
)
</pre>
</div>
<p>
<a href="https://github.com/emacs-evil/evil-surround">Evil-Surround</a> is the evil equivelant of <a href="https://github.com/tpope/vim-surround">surround.vim</a>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package evil-surround
  :ensure t
  :after evil
  :hook evil-mode
)
</pre>
</div>
<p>
<a href="https://github.com/emacsmirror/undo-fu">Undo-Fu</a> provides undo-redo for Emacs.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package undo-fu
  :ensure t
  :after evil
  :custom
  (evil-undo-system 'undo-fu)
)
</pre>
</div>
<p>
<a href="https://github.com/gabesoft/evil-mc">Evil-mc</a> provides multi-cursor functionallity for emacs-evil.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package evil-mc
  :ensure t
  :after evil
  :hook
  evil-mode
  :general
  (:keymaps 'evil-visual-state-map
            ",a" 'evil-mc-make-all-cursors
            )
  (:keymaps 'evil-normal-state-map
            ",d" 'evil-mc-undo-all-cursors
            ",r" 'evil-mc-resume-cursors
            ",p" 'evil-mc-pause-cursors
            ",m" 'evil-mc-make-cursor-here
            )

  (:keymaps 'evil-insert-state-map
            "M-, a" 'evil-mc-make-all-cursors
            "M-, d" 'evil-mc-undo-all-cursors
            "M-, r" 'evil-mc-resume-cursors
            "M-, p" 'evil-mc-pause-cursors
            "M-, m" 'evil-mc-make-cursor-here
            )
)
</pre>
</div>
</div>
</div>
<div id="outline-container-org1931674" class="outline-4">
<h4 id="org1931674"><span class="todo TODO">TODO</span> Magit</h4>
<div class="outline-text-4" id="text-org1931674">
<p>
<a href="https://github.com/magit/magit">Magit</a> is a wrapper around git. Notice the dependency on transient,
perhaps it should be enabled globally as a library from source so its marked as TODO.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package transient
  :ensure t
  )

(use-package magit
  :ensure t
  :general
  (:prefix "C-c m"
      "g" 'magit-status
      "i" 'magit-init
      "c" 'magit-clone)
)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgac109a1" class="outline-4">
<h4 id="orgac109a1">Dired</h4>
<div class="outline-text-4" id="text-orgac109a1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package dired
  :ensure nil
)
</pre>
</div>
</div>
</div>
<div id="outline-container-org177a125" class="outline-4">
<h4 id="org177a125">ISpell</h4>
<div class="outline-text-4" id="text-org177a125">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package ispell
  :ensure nil 
  :custom
  (ispell-program-name "hunspell")
  (ispell-dictionary "en_US,el_GR") 
  :config
  (add-to-list 'ispell-hunspell-dictionary-alist
             '("en_US,el_GR"
               "[[:alpha:]]"
               "[^[:alpha:]]"
               "['’]"
               t
               ("-d" "en_US,el_GR")
               nil
               utf-8)))
  :hook
  (latex-mode . flyspell-mode)
  (markdown-mode . flyspell-mode)
  (org-mode . flyspell-mode)
)
</pre>
</div>
</div>
</div>
<div id="outline-container-orge62b0da" class="outline-4">
<h4 id="orge62b0da">Which-key</h4>
<div class="outline-text-4" id="text-orge62b0da">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package which-key
  :ensure nil
  :init
  (which-key-mode)
  :config 
  (which-key-setup-side-window-bottom)
  :custom
  (which-key-idle-delay 1)
  (which-key-idle-secondary-delay 0.05)
)
</pre>
</div>
</div>
</div>
<div id="outline-container-org9ee12f8" class="outline-4">
<h4 id="org9ee12f8">Eglot</h4>
<div class="outline-text-4" id="text-org9ee12f8">
<p>
Eglot is the built in LSP server for Emacs.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package eglot
  :ensure nil
  :commands (eglot eglot-ensure)
  :init
  (setq eglot-autoshutdown t
        eglot-events-buffer-config 0
        eglot-sync-connect nil
        eglot-confirm-server-edits nil)
)
</pre>
</div>
</div>
</div>
<div id="outline-container-org4143c5e" class="outline-4">
<h4 id="org4143c5e">Eldoc-Box</h4>
<div class="outline-text-4" id="text-org4143c5e">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package eldoc-box
  :ensure t
  :init
  (add-hook 'eglot-managed-mode-hook #'eldoc-box-hover-mode t)
  (add-hook 'prog-mode-hook #'eldoc-box-hover-mode t)
)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdde959f" class="outline-4">
<h4 id="orgdde959f">Flymake</h4>
<div class="outline-text-4" id="text-orgdde959f">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package flymake
  :ensure nil
  :custom
  (flymake-show-diagnostics-at-end-of-line 'fancy)
  :hook
  (prog-mode . flymake-mode)
)
</pre>
</div>
</div>
</div>
<div id="outline-container-org188ad6b" class="outline-4">
<h4 id="org188ad6b">Org</h4>
<div class="outline-text-4" id="text-org188ad6b">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package org
  :ensure `(org :repo "https://code.tecosaur.net/tec/org-mode.git/"
                :branch "dev"
           )
  :config
   (set-face-attribute 'org-block-begin-line nil :height 150)
  :custom
   (org-pretty-entities t)
   (fill-column 70)
  :hook
   (org-mode . auto-fill-mode)
   (org-mode . (lambda ()
                   (font-lock-add-keywords
                    nil
                    '(
                      ("^#\\+begin_src\\(.*\\)$"
                       (0 (progn
                            (compose-region (match-beginning 0) (+ (match-beginning 0) 11) "")
                            nil)))))
                   ))

)
</pre>
</div>
</div>
</div>
