Emacs.org
*** Org Roam
:PROPERTIES:
:ID:       58aed539-b711-444f-aacc-7d936ec93c16
:END:

[[https://github.com/org-roam/org-roam][Org-Roam]] is a note-taking tool.
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-org-roam.el" :mkdirp yes
  (use-package org-roam
    :ensure t
    :init
    (setq org-roam-v2-ack t)
    (org-roam-db-sync)
    :custom
    (org-roam-node-display-template
        (concat "${title:*} "
                (propertize "${tags:10}" 'face 'org-tag)))
    (org-roam-directory my-emacs-notes-dir)
    (org-roam-dailies-directory  (file-truename my-emacs-dailies-dir))
    :config
    (require 'org-roam-export) 
    (org-roam-db-autosync-mode)
    :general
    (:prefix "C-c n"

  	   "D r" 'org-roam-db-sync
  	   
  	   "n i" 'org-roam-node-insert
  	   "n f" 'org-roam-node-find
  	   "n d" 'org-roam-node-remove

  	   "r i" 'org-roam-ref-add
  	   "r d"  'org-roam-ref-remove

  	   "t i" 'org-roam-tag-add
  	   "t d" 'org-roam-tag-remove

  	   "d i" 'org-roam-dailies-capture-today
  	   "d f" 'org-roam-dailies-goto-date
  ))
#+end_src
*** Org2Blog
:PROPERTIES:
:ID:       12db6dab-fef2-48dc-8d5f-bd10ee991a56
:END:
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-org2blog.el" :mkdirp yes
  (use-package org2blog
    :ensure t
    :commands (org2blog-user-interface)
    :config
    (org2blog-user-login)
    :preface
    (defun my-emacs-blog--creds ()
      (let* ((entry (car (auth-source-search
  			:host my-emacs-blog-domain
  			:require '(:user :secret))))
  	   (user (plist-get entry :user))
  	   (secret (plist-get entry :secret))
  	   (pass (if (functionp secret) (funcall secret) secret)))
        (list user pass)))
    (defun my-emacs-blog--run-after-save (post)
      (pp post)
    )
    :custom
    (org2blog/wp-blog-alist
     (let* ((creds (my-emacs-blog--creds))
  	  (user (car creds))
  	  (pass (cadr creds)))
       `((,my-emacs-blog-name
  	:url ,my-emacs-blog-url
  	:username ,user
  	:password ,pass))))
    (org2blog/wp-image-thumbnails t)
    (org2blog/wp-use-wp-latex t)
    (org2blog/wp-image-upload t)
    (org2blog/wp-show-post-in-browser 'show)
    :general
    (:prefix "C-c b" 
  	   "i"     'org2blog-user-interface
  	   "n"     'org2blog-buffer-new

  	   "b p"   'org2blog-buffer-post-publish
  	   "b s"   'org2blog-buffer-post-save 
  	   "b v"   'org2blog-buffer-post-view
  	   "b d"   'org2blog-buffer-post-trash

  	   "p p"   'org2blog-buffer-page-publish
  	   "p s"   'org2blog-buffer-page-save
  	   "p v"   'org2blog-buffer-page-view
  	   "p d"   'org2blog-buffer-page-trash
  	   )
    :hook
    (org2blog-buffer-entry-save . my-emacs-blog--run-after-save)
  )
#+end_src
*** Org Latex Preview
:PROPERTIES:
:ID:       02d5c601-ba6e-409f-89e4-0e928e8fc28a
:END:
#+begin_src emacs-lisp :tangle "my-emacs-packages/org-latex-preview.el" :mkdirp yes
  (use-package org-latex-preview
    :ensure nil
    :config
    (plist-put org-latex-preview-appearance-options
             :page-width 0.8)
    :custom
    (org-latex-preview-mode-display-live t)
    (org-latex-preview-mode-update-delay 0.25)
    (org-latex-preview-ltxpng-directory my-emacs-latex-png-dir)
    (org-latex-create-formula-image-program 'dvisvgm)
    :hook
    (org-mode)
  )
#+end_src
*** Nerd Icons
:PROPERTIES:
:ID:       7acb8b56-d7df-4085-bfb5-8f765ee92c76
:END:
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-nerd-icons.el" :mkdirp yes
  (use-package nerd-icons
    :ensure t
  )
#+end_src
*** Ebib
:PROPERTIES:
:ID:       632416c5-a3da-48e5-83d9-5f34cc9f8f67
:END:
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-ebib.el" :mkdirp yes
  (use-package ebib
    :ensure t
    :custom
    (ebib-bibtex-dialect (car (cdr bibtex-dialect-list)))
    (ebib-bib-search-dirs my-emacs-bibliography-search-dir)
    (ebib-default-directory my-emacs-bibliography)
    (ebib-truncate-file-names nil)
  )
#+end_src
*** Citar
:PROPERTIES:
:ID:       06fae039-5c33-44e3-ba4c-9ddd19b194d8
:END:
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-citar.el" :mkdirp yes
  (use-package citar
    :ensure t
    :custom
    (citar-bibliography my-emacs-citar-bibliographies)
    (org-cite-global-bibliography my-emacs-citar-bibliographies)
    (citar-library-paths my-emacs-citar-library-paths)
    (citar-notes-paths my-emacs-citar-notes-paths)
    (org-cite-insert-processor 'citar)
    (org-cite-follow-processor 'citar)
    (org-cite-activate-processor 'citar)
    :hook
    (LaTeX-mode . citar-capf-setup)
    (org-mode . citar-capf-setup)
    :general
    (:prefix "C-c n"
             "p o" 'citar-open
             "p n" 'citar-open-note
             "p f" 'citar-open-file
             "p l" 'citar-open-links
             "p N" 'citar-open-notes
    )
  )
#+end_src
*** Citar-Embark
:PROPERTIES:
:ID:       aefa8972-f577-4d34-82bb-a67d5584481a
:END:
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-citar-embark.el" :mkdirp yes
  (use-package citar-embark
    :ensure t
    :after (citar embark)
    :config
    (citar-embark-mode)
  )
#+end_src
*** Citar-Org-Roam
:PROPERTIES:
:ID:       be672102-60b7-4866-b0f8-99acc9a8f844
:END:
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-citar-org-roam.el" :mkdirp yes
  (use-package citar-org-roam
    :ensure t
    :after (citar org-roam)
    :config
    (citar-org-roam-mode)
  )
#+end_src
*** Embark && Consult
:PROPERTIES:
:ID:       2df2306f-5a57-4f3d-9f50-40f94d8459bc
:END:
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-consult.el" :mkdirp yes
  (use-package embark-consult
    :ensure t
  )
#+end_src
**** Consult
:PROPERTIES:
:ID:       f4c474be-976b-402c-8239-df92b7c9fa4f
:END:
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-consult.el" :mkdirp yes
  (use-package consult 
    :ensure t
    :general
    ("C-x b" 'consult-buffer)
    ("C-x v r" 'consult-register)
    ("C-x r s" 'consult-register-store)
    ("C-x r l" 'consult-register-load) 
    ("C-x v M"    'consult-global-mark)
    ("C-x v m"    'consult-mark)
    ("C-x C-f" 'consult-find)
    ("M-g g" 'consult-goto-line)
    ("M-g i" 'consult-imenu)
    ("M-g p" 'consult-imenu-multi)
    ("M-g m" 'consult-outline)
    ("M-g f" 'consult-flymake)
    ("M-g c" 'consult-compile-error)
    ("M-s l" 'consult-line)
    ("M-s L" 'consult-line-multi)
    ("M-s g" 'consult-ripgrep)
  )
  :config
  (setq consult-async-min-input 1)
#+end_src
**** Embark
:PROPERTIES:
:ID:       9460042b-f35e-4cee-9ac1-092651f2e905
:END:
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-embark.el" :mkdirp yes
  (use-package embark
    :ensure t
    :general
    ("C-." 'embark-act)
    ("C-;" 'embark-dwim)
  )
#+end_src
*** Project
:PROPERTIES:
:ID:       69ff5518-5561-427b-95cc-0784306c9082
:END:
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-project.el" :mkdirp yes
  (use-package project
    :ensure nil
  )
#+end_src
*** Themes
:PROPERTIES:
:ID:       c14ce9c6-3e64-4379-9ecc-3496f820c091
:END:
**** Ef
:PROPERTIES:
:ID:       702d2015-a26e-4074-9059-dc1c657c0404
:END:
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-ef-theme.el" :mkdirp yes
  (use-package ef-themes
    :ensure t
    :init
    (ef-themes-take-over-modus-themes-mode 1)
    :custom 
    (modus-themes-mixed-fonts t)
    (modus-themes-italic-constructs t)
    :config
    (modus-themes-load-theme 'ef-light)
    )
#+end_src
