Emacs.html
<div id="outline-container-org8673198" class="outline-4">
<h4 id="org8673198">Org Roam</h4>
<div class="outline-text-4" id="text-org8673198">
<p>
<a href="https://github.com/org-roam/org-roam">Org-Roam</a> is a note-taking tool.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package org-roam
  :ensure t
  :init
  (setq org-roam-v2-ack t)
  (org-roam-db-sync)
  :custom
  (org-roam-node-display-template
      (concat "${title:*} "
              (propertize "${tags:10}" 'face 'org-tag)))
  (org-roam-directory (file-truename my-emacs-notes-dir))
  (org-roam-dailies-directory  (file-truename my-emacs-dailies-dir))
  :config
  (require 'org-roam-export) 
  :general
  (:prefix "C-c n"

           "D r" 'org-roam-db-sync

           "n i" 'org-roam-node-insert
           "n f" 'org-roam-node-find
           "n d" 'org-roam-node-remove

           "r i" 'org-roam-ref-add
           "r d"  'org-roam-ref-remove

           "t i" 'org-roam-tag-add
           "t d" 'org-roam-tag-remove

           "d i" 'org-roam-dailies-capture-today
           "d f" 'org-roam-dailies-goto-date
)
</pre>
</div>
</div>
</div>
<div id="outline-container-org981da86" class="outline-4">
<h4 id="org981da86">Org2Blog</h4>
<div class="outline-text-4" id="text-org981da86">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package org2blog
  :ensure t
  :commands (org2blog-user-interface)
  :config
  (org2blog-user-login)
  :preface
  (defun my-emacs-blog--creds ()
    (let* ((entry (car (auth-source-search
                        :host my-emacs-blog-domain
                        :require '(:user :secret))))
           (user (plist-get entry :user))
           (secret (plist-get entry :secret))
           (pass (if (functionp secret) (funcall secret) secret)))
      (list user pass)))
  (defun my-emacs-blog--run-after-save (post)
    (pp post)
  )
  :custom
  (org2blog/wp-blog-alist
   (let* ((creds (my-emacs-blog--creds))
          (user (car creds))
          (pass (cadr creds)))
     `((,my-emacs-blog-name
        :url ,my-emacs-blog-url
        :username ,user
        :password ,pass))))
  (org2blog/wp-image-thumbnails t)
  (org2blog/wp-use-wp-latex t)
  (org2blog/wp-image-upload t)
  (org2blog/wp-show-post-in-browser 'show)
  :general
  (:prefix "C-c b" 
           "i"     'org2blog-user-interface
           "n"     'org2blog-buffer-new

           "b p"   'org2blog-buffer-post-publish
           "b s"   'org2blog-buffer-post-save 
           "b v"   'org2blog-buffer-post-view
           "b d"   'org2blog-buffer-post-trash

           "p p"   'org2blog-buffer-page-publish
           "p s"   'org2blog-buffer-page-save
           "p v"   'org2blog-buffer-page-view
           "p d"   'org2blog-buffer-page-trash
           )
  :hook
  (org2blog-buffer-entry-save . my-emacs-blog--run-after-save)
)
</pre>
</div>
</div>
</div>
<div id="outline-container-org8cf6364" class="outline-4">
<h4 id="org8cf6364">Org Latex Preview</h4>
<div class="outline-text-4" id="text-org8cf6364">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package org-latex-preview
  :ensure nil
  :config
  (plist-put org-latex-preview-appearance-options
           :page-width 0.8)
  :custom
  (org-latex-preview-mode-display-live t)
  (org-latex-preview-mode-update-delay 0.25)
  (org-latex-preview-ltxpng-directory my-emacs-latex-png-dir)
  (org-latex-create-formula-image-program 'dvisvgm)
  :hook
  (org-mode)
)
</pre>
</div>
</div>
</div>
<div id="outline-container-org632b9d8" class="outline-4">
<h4 id="org632b9d8">Embark &amp;&amp; Consult</h4>
<div class="outline-text-4" id="text-org632b9d8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package embark-consult
  :ensure t
)
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="org666590d"></a>Consult<br />
<div class="outline-text-5" id="text-org666590d">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package consult 
  :ensure t
  :general
  ("C-x b" 'consult-buffer)
  ("C-x v r" 'consult-register)
  ("C-x r s" 'consult-register-store)
  ("C-x r l" 'consult-register-load) 
  ("C-x v M"    'consult-global-mark)
  ("C-x v m"    'consult-mark)
  ("C-x C-f" 'consult-find)
  ("M-g g" 'consult-goto-line)
  ("M-g i" 'consult-imenu)
  ("M-g p" 'consult-imenu-multi)
  ("M-g m" 'consult-outline)
  ("M-g f" 'consult-flymake)
  ("M-g c" 'consult-compile-error)
  ("M-s l" 'consult-line)
  ("M-s L" 'consult-line-multi)
  ("M-s g" 'consult-ripgrep)
)
:config
(setq consult-async-min-input 1)
</pre>
</div>
</div>
</li>
<li><a id="org007027b"></a>Embark<br />
<div class="outline-text-5" id="text-org007027b">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package embark
  :ensure t
  :general
  ("C-." 'embark-act)
  ("C-;" 'embark-dwim)
)
</pre>
</div>
</div>
</li>
</ul>
</div>
<div id="outline-container-orge26f00e" class="outline-4">
<h4 id="orge26f00e">Project</h4>
<div class="outline-text-4" id="text-orge26f00e">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package project
  :ensure nil
)
</pre>
</div>
</div>
</div>
<div id="outline-container-org6c10842" class="outline-4">
<h4 id="org6c10842">Themes</h4>
<div class="outline-text-4" id="text-org6c10842">
</div>
<ul class="org-ul">
<li><a id="org13a2219"></a>Ef<br />
<div class="outline-text-5" id="text-org13a2219">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package ef-themes
  :ensure t
  :init
  (ef-themes-take-over-modus-themes-mode 1)
  :custom 
  (modus-themes-mixed-fonts t)
  (modus-themes-italic-constructs t)
  :config
  (modus-themes-load-theme 'ef-light)
  )
</pre>
</div>
</div>
</li>
</ul>
</div>
