Emacs.org
*** Autocompletion
:PROPERTIES:
:ID:       5508413d-791d-4107-a7a0-265daadf1b64
:END:
Vertico offers, vertical autocompletions on the minibuffer.
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-vertico.el" :mkdirp yes
  (use-package vertico
    :ensure t
    :custom
    (vertico-cycle t)
    :init
    (vertico-mode) 
    :general
    (
     :keymaps 'vertico-map
  	    "C-k" 'vertico-previous
  	    "C-j" 'vertico-next
    )
  )
#+end_src
Marginalia offers comments right next to the commands on the minibuffer.
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-marginalia.el" :mkdirp yes
  (use-package marginalia
    :ensure t
    :init
    (marginalia-mode)
  )
#+end_src

#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-corfu.el" :mkdirp yes
  (use-package corfu
    :ensure t
    :init
    (global-corfu-mode)
    :general (:keymaps 'corfu-map
  	    "C-k" 'corfu-previous
  	    "C-j" 'corfu-next
  	    "C-d" 'corfu-info-documentation
  	    "C-a" 'corfu-info-location
  	    "C-h" 'corfu-quit
  	    "C-l" 'corfu-insert
  	    "C-m" 'corfu-move-to-minibuffer)
    ("C-l" 'completion-at-point)
  )
#+end_src

#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-dabbrev.el" :mkdirp yes
  (use-package dabbrev
    :ensure nil
    :bind (("C-M-/" . dabbrev-expand))
    :config
    (add-to-list 'dabbrev-ignored-buffer-regexps "\\` ")
    (add-to-list 'dabbrev-ignored-buffer-modes 'doc-view-mode)
    (add-to-list 'dabbrev-ignored-buffer-modes 'pdf-view-mode)
    (add-to-list 'dabbrev-ignored-buffer-modes 'tags-table-mode)
  )
#+end_src

#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-cape.el" :mkdirp yes
  (use-package cape
    :ensure t
    :init
    (add-hook 'completion-at-point-functions #'cape-dabbrev)
    (add-hook 'completion-at-point-functions #'cape-file)
    (add-hook 'completion-at-point-functions #'cape-elisp-block)
    (add-hook 'completion-at-point-functions #'cape-history)
    (add-hook 'completion-at-point-functions #'cape-abbrev)
    (add-hook 'completion-at-point-functions #'cape-dict)
    (add-hook 'completion-at-point-functions #'cape-elisp-block)
    (add-hook 'completion-at-point-functions #'cape-keyword)
    (add-hook 'completion-at-point-functions #'cape-tex)
  )
#+end_src

#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-kind-icon.el" :mkdirp yes
  (use-package kind-icon
    :ensure t
    :after corfu
    :config
    (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter))
#+end_src

#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-orderless.el" :mkdirp yes
  (use-package orderless
    :ensure t
    :custom
    (completion-styles '(orderless partial-completion basic))
    (completion-category-defaults nil)
    (completion-category-overrides nil)
  )
#+end_src
*** Email
:PROPERTIES:
:ID:       b199f3cd-bc96-4140-b725-4ca320e90998
:END:
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-email.el" :mkdirp yes
  (use-package notmuch
    :ensure t
    :config
    (setq send-mail-function 'sendmail-send-it
      sendmail-program "/usr/bin/msmtp"
      mail-specify-envelope-from t
      message-sendmail-envelope-from 'header
      mail-envelope-from 'header)
    (setq notmuch-fcc-dirs nil)
  )
#+end_src
*** Org-Mime
:PROPERTIES:
:ID:       fea4ce12-bf6d-4e2b-a26a-80290f59d61d
:END:
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-org-mime.el" :mkdirp yes
  (use-package org-mime
    :ensure t 
  )
#+end_src
*** Programming Languages
:PROPERTIES:
:ID:       aded49c3-48a3-462a-8f24-abeb5bae2eb6
:END:
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-rust.el" :mkdirp yes
  (use-package prog-mode
    :ensure nil
    :custom
    (display-line-numbers-type 'relative)
    (fill-column 100)
    :hook
    (prog-mode . display-line-numbers-mode)
    (prog-mode . auto-fill-mode)
  )
#+end_src
**** Rust
:PROPERTIES:
:ID:       df45555c-c0db-4a4e-acfe-80d8b1613896
:END:
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-rust.el" :mkdirp yes
  (use-package rustic
    :ensure t
    :custom
    (rustic-lsp-client 'eglot)
    :hook
    (rustic-mode . eglot-ensure)
  )
#+end_src
**** Ocaml
:PROPERTIES:
:ID:       e7be6e66-5cbc-4476-8d0e-de5726cdc42b
:END:
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-ocaml.el" :mkdirp yes
  (use-package tuareg
    :ensure t
    :hook
    (tuareg-mode . eglot-ensure)
  )
#+end_src
**** Haskell
:PROPERTIES:
:ID:       a1cab303-6f5b-4057-8fc1-d222f931d16b
:END:
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-haskell.el" :mkdirp yes
  (use-package haskell-mode
    :ensure t
    :hook
    (haskell-mode . eglot-ensure)
  )
#+end_src
**** Python
:PROPERTIES:
:ID:       cd2a8f9c-1eb4-488b-b77b-e79c5b95b2f4
:END:
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-python.el" :mkdirp yes
  (use-package python-mode
    :ensure nil
    :hook
    (python-mode . eglot-ensure)
  )
#+end_src
**** C++
:PROPERTIES:
:ID:       97478dcf-d9c9-4816-ab7e-7469d41169e3
:END:
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-cpp.el" :mkdirp yes
  (use-package c++-mode
    :ensure nil
    :hook
    (c++-mode . eglot-ensure)
  )
#+end_src
**** GLSL
#+begin_src emacs-lisp :tangle "my-emacs-packages/my-emacs-glsl.el" :mkdirp yes
  (use-package glsl-mode
    :ensure t
  )
#+end_src
