Emacs.html
<div id="outline-container-org6f3d1e3" class="outline-4">
<h4 id="org6f3d1e3">Autocompletion</h4>
<div class="outline-text-4" id="text-org6f3d1e3">
<p>
Vertico offers, vertical autocompletions on the minibuffer.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package vertico
  :ensure t
  :custom
  (vertico-cycle t)
  :init
  (vertico-mode) 
  :general
  (
   :keymaps 'vertico-map
            "C-k" 'vertico-previous
            "C-j" 'vertico-next
  )
)
</pre>
</div>
<p>
Marginalia offers comments right next to the commands on the minibuffer.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package marginalia
  :ensure t
  :init
  (marginalia-mode)
)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package corfu
  :ensure t
  :init
  (global-corfu-mode)
  :general (:keymaps 'corfu-map
            "C-k" 'corfu-previous
            "C-j" 'corfu-next
            "C-d" 'corfu-info-documentation
            "C-a" 'corfu-info-location
            "C-h" 'corfu-quit
            "C-l" 'corfu-insert
            "C-m" 'corfu-move-to-minibuffer)
  ("C-l" 'completion-at-point)
)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package dabbrev
  :ensure nil
  :bind (("C-M-/" . dabbrev-expand))
  :config
  (add-to-list 'dabbrev-ignored-buffer-regexps "\\` ")
  (add-to-list 'dabbrev-ignored-buffer-modes 'doc-view-mode)
  (add-to-list 'dabbrev-ignored-buffer-modes 'pdf-view-mode)
  (add-to-list 'dabbrev-ignored-buffer-modes 'tags-table-mode)
)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package cape
  :ensure t
  :init
  (add-hook 'completion-at-point-functions #'cape-dabbrev)
  (add-hook 'completion-at-point-functions #'cape-file)
  (add-hook 'completion-at-point-functions #'cape-elisp-block)
  (add-hook 'completion-at-point-functions #'cape-history)
  (add-hook 'completion-at-point-functions #'cape-abbrev)
  (add-hook 'completion-at-point-functions #'cape-dict)
  (add-hook 'completion-at-point-functions #'cape-elisp-block)
  (add-hook 'completion-at-point-functions #'cape-keyword)
  (add-hook 'completion-at-point-functions #'cape-tex)
)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package kind-icon
  :ensure t
  :after corfu
  :config
  (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package orderless
  :ensure t
  :custom
  (completion-styles '(orderless partial-completion basic))
  (completion-category-defaults nil)
  (completion-category-overrides nil)
)
</pre>
</div>
</div>
</div>
<div id="outline-container-org0339d00" class="outline-4">
<h4 id="org0339d00">Email</h4>
<div class="outline-text-4" id="text-org0339d00">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package notmuch
  :ensure t
  :config
  (setq send-mail-function 'sendmail-send-it
    sendmail-program "/usr/bin/msmtp"
    mail-specify-envelope-from t
    message-sendmail-envelope-from 'header
    mail-envelope-from 'header)
  (setq notmuch-fcc-dirs nil)
)
</pre>
</div>
</div>
</div>
<div id="outline-container-orga85e3da" class="outline-4">
<h4 id="orga85e3da">Org-Mime</h4>
<div class="outline-text-4" id="text-orga85e3da">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package org-mime
  :ensure t 
)
</pre>
</div>
</div>
</div>
<div id="outline-container-org446311c" class="outline-4">
<h4 id="org446311c">Programming Languages</h4>
<div class="outline-text-4" id="text-org446311c">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package prog-mode
  :ensure nil
  :custom
  (display-line-numbers-type 'relative)
  (fill-column 100)
  :hook
  (prog-mode . display-line-numbers-mode)
  (prog-mode . auto-fill-mode)
)
</pre>
</div>
</div>
<ul class="org-ul">
<li><a id="orgf740717"></a>Rust<br />
<div class="outline-text-5" id="text-orgf740717">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package rustic
  :ensure t
  :custom
  (rustic-lsp-client 'eglot)
  :hook
  (rustic-mode . eglot-ensure)
)
</pre>
</div>
</div>
</li>
<li><a id="org5089cf7"></a>Ocaml<br />
<div class="outline-text-5" id="text-org5089cf7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package tuareg
  :ensure t
  :hook
  (tuareg-mode . eglot-ensure)
)
</pre>
</div>
</div>
</li>
<li><a id="orgaaf922f"></a>Haskell<br />
<div class="outline-text-5" id="text-orgaaf922f">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package haskell-mode
  :ensure t
  :hook
  (haskell-mode . eglot-ensure)
)
</pre>
</div>
</div>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Chris Liourtas</p>
<p class="date">Created: 2025-11-05 Wed 12:14</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
